trumsotroll/learnGitCI-CD/hal/inc/S32K144_Package.h
/*
 * S32K144_Package.h
 *
 *  Created on: Jan 9, 2026
 *  Author: khang
 */

#ifndef S32K144_PACKAGE_H_
#define S32K144_PACKAGE_H_

/**
 *  Mã hóa ARM_GPIO_Pin_t
 * + bit (0 - 4): Pin ID, mô tả dãy giá trị [0 - 31]
 * + bit (5 - 7): Port ID, mô tả dãy giá trị [0 - 7]
 * vì coder sử dụng macro đã định sẵn nên không cần xử lý nhập PortID [5 - 7]
 */
#define FIVELOWMASK 0x1F
#define GPIO_PIN(port, pin) (((uint32_t)(port)) << 5 | ((uint32_t)(pin) & FIVELOWMASK))

/** GPIO Pin Macro config PORTA */
#define PORTA_PIN0      GPIO_PIN(0, 0)
#define PORTA_PIN1      GPIO_PIN(0, 1)
#define PORTA_PIN2      GPIO_PIN(0, 2)
#define PORTA_PIN3      GPIO_PIN(0, 3)
#define PORTA_PIN4      GPIO_PIN(0, 4)
#define PORTA_PIN5      GPIO_PIN(0, 5)
#define PORTA_PIN6      GPIO_PIN(0, 6)
#define PORTA_PIN7      GPIO_PIN(0, 7)
#define PORTA_PIN8      GPIO_PIN(0, 8)
#define PORTA_PIN9      GPIO_PIN(0, 9)
#define PORTA_PIN10     GPIO_PIN(0, 10)
#define PORTA_PIN11     GPIO_PIN(0, 11)
#define PORTA_PIN12     GPIO_PIN(0, 12)
#define PORTA_PIN13     GPIO_PIN(0, 13)
#define PORTA_PIN14     GPIO_PIN(0, 14)
#define PORTA_PIN15     GPIO_PIN(0, 15)
#define PORTA_PIN16     GPIO_PIN(0, 16)
#define PORTA_PIN17     GPIO_PIN(0, 17)
#define PORTA_PIN18     GPIO_PIN(0, 18)
#define PORTA_PIN19     GPIO_PIN(0, 19)
#define PORTA_PIN20     GPIO_PIN(0, 20)
#define PORTA_PIN21     GPIO_PIN(0, 21)
#define PORTA_PIN22     GPIO_PIN(0, 22)
#define PORTA_PIN23     GPIO_PIN(0, 23)
#define PORTA_PIN24     GPIO_PIN(0, 24)
#define PORTA_PIN25     GPIO_PIN(0, 25)
#define PORTA_PIN26     GPIO_PIN(0, 26)
#define PORTA_PIN27     GPIO_PIN(0, 27)
#define PORTA_PIN28     GPIO_PIN(0, 28)
#define PORTA_PIN29     GPIO_PIN(0, 29)
#define PORTA_PIN30     GPIO_PIN(0, 30)
#define PORTA_PIN31     GPIO_PIN(0, 31)

/** GPIO Pin Macro config PORTB */
#define PORTB_PIN0      GPIO_PIN(1, 0)
#define PORTB_PIN1      GPIO_PIN(1, 1)
#define PORTB_PIN2      GPIO_PIN(1, 2)
#define PORTB_PIN3      GPIO_PIN(1, 3)
#define PORTB_PIN4      GPIO_PIN(1, 4)
#define PORTB_PIN5      GPIO_PIN(1, 5)
#define PORTB_PIN6      GPIO_PIN(1, 6)
#define PORTB_PIN7      GPIO_PIN(1, 7)
#define PORTB_PIN8      GPIO_PIN(1, 8)
#define PORTB_PIN9      GPIO_PIN(1, 9)
#define PORTB_PIN10     GPIO_PIN(1, 10)
#define PORTB_PIN11     GPIO_PIN(1, 11)
#define PORTB_PIN12     GPIO_PIN(1, 12)
#define PORTB_PIN13     GPIO_PIN(1, 13)
#define PORTB_PIN14     GPIO_PIN(1, 14)
#define PORTB_PIN15     GPIO_PIN(1, 15)
#define PORTB_PIN16     GPIO_PIN(1, 16)
#define PORTB_PIN17     GPIO_PIN(1, 17)
#define PORTB_PIN18     GPIO_PIN(1, 18)
#define PORTB_PIN19     GPIO_PIN(1, 19)
#define PORTB_PIN20     GPIO_PIN(1, 20)
#define PORTB_PIN21     GPIO_PIN(1, 21)
#define PORTB_PIN22     GPIO_PIN(1, 22)
#define PORTB_PIN23     GPIO_PIN(1, 23)
#define PORTB_PIN24     GPIO_PIN(1, 24)
#define PORTB_PIN25     GPIO_PIN(1, 25)
#define PORTB_PIN26     GPIO_PIN(1, 26)
#define PORTB_PIN27     GPIO_PIN(1, 27)
#define PORTB_PIN28     GPIO_PIN(1, 28)
#define PORTB_PIN29     GPIO_PIN(1, 29)
#define PORTB_PIN30     GPIO_PIN(1, 30)
#define PORTB_PIN31     GPIO_PIN(1, 31)

/** GPIO Pin Macro config PORTC */
#define PORTC_PIN0      GPIO_PIN(2, 0)
#define PORTC_PIN1      GPIO_PIN(2, 1)
#define PORTC_PIN2      GPIO_PIN(2, 2)
#define PORTC_PIN3      GPIO_PIN(2, 3)
#define PORTC_PIN4      GPIO_PIN(2, 4)
#define PORTC_PIN5      GPIO_PIN(2, 5)
#define PORTC_PIN6      GPIO_PIN(2, 6)
#define PORTC_PIN7      GPIO_PIN(2, 7)
#define PORTC_PIN8      GPIO_PIN(2, 8)
#define PORTC_PIN9      GPIO_PIN(2, 9)
#define PORTC_PIN10     GPIO_PIN(2, 10)
#define PORTC_PIN11     GPIO_PIN(2, 11)
#define PORTC_PIN12     GPIO_PIN(2, 12)
#define PORTC_PIN13     GPIO_PIN(2, 13)
#define PORTC_PIN14     GPIO_PIN(2, 14)
#define PORTC_PIN15     GPIO_PIN(2, 15)
#define PORTC_PIN16     GPIO_PIN(2, 16)
#define PORTC_PIN17     GPIO_PIN(2, 17)
#define PORTC_PIN18     GPIO_PIN(2, 18)
#define PORTC_PIN19     GPIO_PIN(2, 19)
#define PORTC_PIN20     GPIO_PIN(2, 20)
#define PORTC_PIN21     GPIO_PIN(2, 21)
#define PORTC_PIN22     GPIO_PIN(2, 22)
#define PORTC_PIN23     GPIO_PIN(2, 23)
#define PORTC_PIN24     GPIO_PIN(2, 24)
#define PORTC_PIN25     GPIO_PIN(2, 25)
#define PORTC_PIN26     GPIO_PIN(2, 26)
#define PORTC_PIN27     GPIO_PIN(2, 27)
#define PORTC_PIN28     GPIO_PIN(2, 28)
#define PORTC_PIN29     GPIO_PIN(2, 29)
#define PORTC_PIN30     GPIO_PIN(2, 30)
#define PORTC_PIN31     GPIO_PIN(2, 31)

/** GPIO Pin Macro config PORTD */
#define PORTD_PIN0      GPIO_PIN(3, 0)
#define PORTD_PIN1      GPIO_PIN(3, 1)
#define PORTD_PIN2      GPIO_PIN(3, 2)
#define PORTD_PIN3      GPIO_PIN(3, 3)
#define PORTD_PIN4      GPIO_PIN(3, 4)
#define PORTD_PIN5      GPIO_PIN(3, 5)
#define PORTD_PIN6      GPIO_PIN(3, 6)
#define PORTD_PIN7      GPIO_PIN(3, 7)
#define PORTD_PIN8      GPIO_PIN(3, 8)
#define PORTD_PIN9      GPIO_PIN(3, 9)
#define PORTD_PIN10     GPIO_PIN(3, 10)
#define PORTD_PIN11     GPIO_PIN(3, 11)
#define PORTD_PIN12     GPIO_PIN(3, 12)
#define PORTD_PIN13     GPIO_PIN(3, 13)
#define PORTD_PIN14     GPIO_PIN(3, 14)
#define PORTD_PIN15     GPIO_PIN(3, 15)
#define PORTD_PIN16     GPIO_PIN(3, 16)
#define PORTD_PIN17     GPIO_PIN(3, 17)
#define PORTD_PIN18     GPIO_PIN(3, 18)
#define PORTD_PIN19     GPIO_PIN(3, 19)
#define PORTD_PIN20     GPIO_PIN(3, 20)
#define PORTD_PIN21     GPIO_PIN(3, 21)
#define PORTD_PIN22     GPIO_PIN(3, 22)
#define PORTD_PIN23     GPIO_PIN(3, 23)
#define PORTD_PIN24     GPIO_PIN(3, 24)
#define PORTD_PIN25     GPIO_PIN(3, 25)
#define PORTD_PIN26     GPIO_PIN(3, 26)
#define PORTD_PIN27     GPIO_PIN(3, 27)
#define PORTD_PIN28     GPIO_PIN(3, 28)
#define PORTD_PIN29     GPIO_PIN(3, 29)
#define PORTD_PIN30     GPIO_PIN(3, 30)
#define PORTD_PIN31     GPIO_PIN(3, 31)

/** GPIO Pin Macro config PORTE */
#define PORTE_PIN0      GPIO_PIN(4, 0)
#define PORTE_PIN1      GPIO_PIN(4, 1)
#define PORTE_PIN2      GPIO_PIN(4, 2)
#define PORTE_PIN3      GPIO_PIN(4, 3)
#define PORTE_PIN4      GPIO_PIN(4, 4)
#define PORTE_PIN5      GPIO_PIN(4, 5)
#define PORTE_PIN6      GPIO_PIN(4, 6)
#define PORTE_PIN7      GPIO_PIN(4, 7)
#define PORTE_PIN8      GPIO_PIN(4, 8)
#define PORTE_PIN9      GPIO_PIN(4, 9)
#define PORTE_PIN10     GPIO_PIN(4, 10)
#define PORTE_PIN11     GPIO_PIN(4, 11)
#define PORTE_PIN12     GPIO_PIN(4, 12)
#define PORTE_PIN13     GPIO_PIN(4, 13)
#define PORTE_PIN14     GPIO_PIN(4, 14)
#define PORTE_PIN15     GPIO_PIN(4, 15)
#define PORTE_PIN16     GPIO_PIN(4, 16)
#define PORTE_PIN17     GPIO_PIN(4, 17)
#define PORTE_PIN18     GPIO_PIN(4, 18)
#define PORTE_PIN19     GPIO_PIN(4, 19)
#define PORTE_PIN20     GPIO_PIN(4, 20)
#define PORTE_PIN21     GPIO_PIN(4, 21)
#define PORTE_PIN22     GPIO_PIN(4, 22)
#define PORTE_PIN23     GPIO_PIN(4, 23)
#define PORTE_PIN24     GPIO_PIN(4, 24)
#define PORTE_PIN25     GPIO_PIN(4, 25)
#define PORTE_PIN26     GPIO_PIN(4, 26)
#define PORTE_PIN27     GPIO_PIN(4, 27)
#define PORTE_PIN28     GPIO_PIN(4, 28)
#define PORTE_PIN29     GPIO_PIN(4, 29)
#define PORTE_PIN30     GPIO_PIN(4, 30)
#define PORTE_PIN31     GPIO_PIN(4, 31)

#endif /* S32K144_PACKAGE_H_ */
